In [1]:
import sqlite3
import pandas as pd


# conn to the STAFF.db
conn = sqlite3.connect('STAFF.db')

In [2]:
print(conn)

<sqlite3.Connection object at 0x000001E6D1926890>

In [3]:
table_name = 'INSTRUCTOR'
attribute_list = ['ID', 'FNAME', 'LNAME', 'CITY', 'CCODE']

In [5]:
file_path = 'C:/Users/10826733/Downloads/INSTRUCTOR.csv'
df = pd.read_csv(file_path, names = attribute_list)
df

    ID    FNAME      LNAME      CITY CCODE
0    1      Rav      Ahuja   TORONTO    CA
1    2     Raul      Chong   Markham    CA
2    3     Hima  Vasudevan   Chicago    US
3    4     John     Thomas  Illinois    US
4    5    Alice      James  Illinois    US
5    6    Steve      Wells  Illinois    US
6    7  Santosh      Kumar  Illinois    US
7    8    Ahmed    Hussain  Illinois    US
8    9    Nancy      Allen  Illinois    US
9   10     Mary     Thomas  Illinois    US
10  11  Bharath      Gupta  Illinois    US
11  12   Andrea      Jones  Illinois    US
12  13      Ann      Jacob  Illinois    US
13  14     Amit      Kumar  NewDelhi    IN

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [6]:
df.to_sql(table_name, conn, if_exists = 'replace', index =False)
print('Table is ready')

14

Table is ready

In [14]:
query_statement = f"SELECT * FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT * FROM INSTRUCTOR
     ID    FNAME      LNAME      CITY CCODE
0     1      Rav      Ahuja   TORONTO    CA
1     2     Raul      Chong   Markham    CA
2     3     Hima  Vasudevan   Chicago    US
3     4     John     Thomas  Illinois    US
4     5    Alice      James  Illinois    US
5     6    Steve      Wells  Illinois    US
6     7  Santosh      Kumar  Illinois    US
7     8    Ahmed    Hussain  Illinois    US
8     9    Nancy      Allen  Illinois    US
9    10     Mary     Thomas  Illinois    US
10   11  Bharath      Gupta  Illinois    US
11   12   Andrea      Jones  Illinois    US
12   13      Ann      Jacob  Illinois    US
13   14     Amit      Kumar  NewDelhi    IN
14  100     John        Doe     Paris    FR

In [8]:
query_statement = f"SELECT FNAME FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT FNAME FROM INSTRUCTOR
      FNAME
0       Rav
1      Raul
2      Hima
3      John
4     Alice
5     Steve
6   Santosh
7     Ahmed
8     Nancy
9      Mary
10  Bharath
11   Andrea
12      Ann
13     Amit

In [9]:
query_statement = f"SELECT COUNT(*) FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT COUNT(*) FROM INSTRUCTOR
   COUNT(*)
0        14

In [11]:
data_dict = {'ID' : [100],
            'FNAME' : ['John'],
            'LNAME' : ['Doe'],
            'CITY' : ['Paris'],
            'CCODE' : ['FR']}
data_append = pd.DataFrame(data_dict)

In [13]:
data_append.to_sql(table_name, conn, if_exists = 'append', index =False)
print('Data appended successfully')

1

Data appended successfully

In [15]:
conn.close()